app/mailers/contact_mailer.rb

  def user_email user_id, first_name, last_name, email, message
    @user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]