app/controllers/properties_controller.rb

  def index
    @properties = current_user.properties
    @properties_for_buyer = Property.where(status: false)
---
SELECT "properties".* FROM "properties" WHERE "properties"."status" = $1  [["status", false]]

  def show
    @user = @property.user
    @user_properties = Property.where(user_id: @user.id).where.not(id: @property.id)
---
SELECT "properties".* FROM "properties" WHERE "properties"."user_id" = $1 AND "properties"."id" != $2  [["user_id", 2], ["id", 1]]

  def create
    @property = Property.new(property_params)
    @property.user_id = current_user.id

    respond_to do |format|
      if @property.save
---
INSERT INTO "properties" ("name", "address", "price", "rooms", "parking_spaces", "image", "user_id", "created_at", "updated_at", "details", "for_sale", "available_date") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def property_update
    @property = Property.find(params[:format])
    @dup_property = @property.amoeba_dup
    @dup_property.save
    @dup_property.update_attributes(status: true, user_id: current_user.id)
    @property.update_attributes(status: true)
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "properties" SET "user_id" = $1, "updated_at" = $2, "status" = $3 WHERE "properties"."id" = $4  [["user_id", 3], ["updated_at", "2023-03-17 16:38:38.771653"], ["status", true], ["id", 4]]
INSERT INTO "properties" ("name", "address", "price", "rooms", "parking_spaces", "image", "user_id", "created_at", "updated_at", "details", "for_sale", "available_date") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
UPDATE "properties" SET "status" = $1, "updated_at" = $2 WHERE "properties"."id" = $3  [["status", true], ["updated_at", "2023-03-17 16:38:38.786456"], ["id", 2]]

  def property_buy
    @properties = current_user.properties.where(status: true)
---
SELECT "properties".* FROM "properties" WHERE "properties"."user_id" = $1 AND "properties"."status" = $2  [["user_id", 3], ["status", true]]