app/controllers/public_controller.rb

SELECT "properties".* FROM "properties" WHERE "properties"."status" = $1  [["status", false]]
SELECT "properties".* FROM "properties" WHERE "properties"."user_id" = $1  [["user_id", 2]]
---
  def index
    if current_user
      if current_user.type == 'seller'
        @properties = current_user.properties
      else
        @properties = Property.where(status: false)
      end
    else
      @properties = Property.all